{
  "Basics": {
    "iconName": "Disc3",
    "description": "Master the fundamental skill of seamlessly transitioning between tracks using volume and EQ controls.",
    "tip": "Start with tracks in similar BPM ranges for smoother transitions."
  },
  "Beatmatching": {
    "iconName": "Waves",
    "description": "Learn to synchronize the tempo and beats of two tracks for perfect transitions.",
    "tip": "Practice identifying the first beat of each bar to align tracks correctly."
  },
  "Build-Up/Breakdown": {
    "iconName": "ArrowUpDown",
    "description": "Create dynamic energy shifts by layering build-ups and breakdowns from multiple tracks.",
    "tip": "Use EQ to emphasize different elements during transitions."
  },
  "Drops": {
    "iconName": "Combine",
    "description": "Drop two tracks simultaneously or switch between drops of different tracks.",
    "tip": "Use harmonically compatible tracks and practice quick swaps for the best effect."
  },
  "EQ": {
    "iconName": "Sliders",
    "description": "Control different frequency ranges to blend tracks professionally.",
    "tip": "Start by swapping similar frequencies between tracks."
  },
  "Filter Transition": {
    "iconName": "Filter",
    "description": "Use high-pass and low-pass filters for creative mixing effects.",
    "tip": "Combine filter sweeps with EQ adjustments for smoother transitions."
  },
  "FX": {
    "iconName": "Volume2",
    "description": "Use effects to change energy, create tension, and smooth out transitions.",
    "tip": "Time your echo outs with the phrase length of the incoming track."
  },  
  "Key": {
    "iconName": "Music2",
    "description": "Mix tracks that are in compatible musical keys for seamless blends.",
    "tip": "Use the Camelot Wheel to find harmonically compatible tracks."
  },
  "Loops": {
    "iconName": "Repeat",
    "description": "Create perfect loops to extend sections or create unique transitions.",
    "tip": "Practice setting loop points on phrase boundaries."
  },
  "Stems": {
    "iconName": "Layers",
    "description": "Isolate vocals, instruments and drums.",
    "tip": "Combine elements from different tracks to create live mashups."
  },
  "Scratching": {
    "iconName": "Shell",
    "description": "What is a DJ if he can't scratch?",
    "tip": "Start at slower tempos and build up hand speed and coordination as you progress."
  }
}
